# Задача 4
a=int(input("Введите число: "))

b=a*(2/3)
c=(a-b)/2

print(b,c,c)

